#include <iostream>
using namespace std;
int main() {
	////If1.Дано целое число.Если оно является положительным, то прибавить к нему 1; в противном случае не изменять его.Вывести полученное число
	//int a;
	//cin >> a;
	//if (a > 0) {
	//	a += 1;// a = a + 1; a++;
	//}
	//cout << a << endl;
	////If2.Дано целое число.Если оно является положительным, то прибавить к нему 1; в противном случае вычесть из него 2. Вывести полученное число.
	//int a;
	//cin >> a;
	//if (a > 0) {
	//	a += 1;
	//}
	//else {
	//	a -= 2; // a = a - 2
	//}
	//cout << a << endl;
	////////////
	/*int a;
	cin >> a;
	if (a > 0) {
		a ++
	{
	else {
		if (a < 0) {
			a -= 2;
		}
		else {
			if (a == 0) {
				a = 10;
				a = 10;
			}*/
	//If4.Даны три целых числа.Найти количество положительных чисел в исходном наборе.
	/*int a, b, c;
	int  k = 0;
	if (a > 0) {
		k++;
    }
	if (c > 0) {
		k++;
	}
	cout << k << endl;*/
	//If6.Даны два числа.Вывести большее из них
	/*int a, b;
	cin >> a >> b;
	if (a > b) {
		cout << a << endl;
    }
	else if (b > a) {
		cout << b << endl;
	}
	else if (a == b) {
		cout << "=" << endl;*/
	
	//If7.Даны два числа.Вывести порядковый номер меньшего из них.
	/*int a, b;
	cin >> a >> b;
	if (a < b ) {
		cout << a << endl;
	}
	else if (a > b) {
		cout << b << endl;
	}
	else if (a < b) {
		cout << "<" << endl;*/
	//If8.Даны два числа.Вывести вначале большее, а затем меньшее из них.
	int b, c;
	cin >> b >> c;
	if (b > c) {
		cout << b << endl;
    }
	else if (b < c) {
		cout << c << endl;

	}





	


}
